trteodor/Line_Follower_STM32H7/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h7xx_hal.h"
#include "stm32h7xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define IR_PIN_Pin GPIO_PIN_2
#define IR_PIN_GPIO_Port GPIOE
#define IR_PIN_EXTI_IRQn EXTI2_IRQn
#define ENK1_Pin GPIO_PIN_3
#define ENK1_GPIO_Port GPIOE
#define ENK1_EXTI_IRQn EXTI3_IRQn
#define ENK2_Pin GPIO_PIN_4
#define ENK2_GPIO_Port GPIOE
#define ENK2_EXTI_IRQn EXTI4_IRQn
#define IR_LED_Pin GPIO_PIN_13
#define IR_LED_GPIO_Port GPIOC
#define LD3_Pin GPIO_PIN_2
#define LD3_GPIO_Port GPIOB
#define LD4_Pin GPIO_PIN_7
#define LD4_GPIO_Port GPIOE
#define ENK4_Pin GPIO_PIN_6
#define ENK4_GPIO_Port GPIOC
#define ENK4_EXTI_IRQn EXTI9_5_IRQn
#define ENK3_Pin GPIO_PIN_7
#define ENK3_GPIO_Port GPIOC
#define ENK3_EXTI_IRQn EXTI9_5_IRQn
#define LDD1_Pin GPIO_PIN_15
#define LDD1_GPIO_Port GPIOA
#define EEPROM_WC_Pin GPIO_PIN_7
#define EEPROM_WC_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */
extern int LED_BLINK;

extern void LED_BLINKING();
/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
